In [1]:
import sqlite3
import pandas as pd

In [3]:
#connect to sql database
conn = sqlite3.connect('retail_sales.db')
cursor = conn.cursor()

In [5]:
#read the csv using pandas
csv_file = 'SQL - Retail Sales Analysis_utf .csv'  # put your correct CSV file path here
df = pd.read_csv(csv_file)
print(df.head())

   transactions_id   sale_date sale_time  customer_id  gender   age  category  \
0              180  2022-11-05  10:47:00          117    Male  41.0  Clothing
1              522  2022-07-09  11:00:00           52    Male  46.0    Beauty
2              559  2022-12-12  10:48:00            5  Female  40.0  Clothing
3             1180  2022-01-06  08:53:00           85    Male  41.0  Clothing
4             1522  2022-11-14  08:35:00           48    Male  46.0    Beauty

   quantiy  price_per_unit   cogs  total_sale
0      3.0           300.0  129.0       900.0
1      3.0           500.0  145.0      1500.0
2      4.0           300.0   84.0      1200.0
3      3.0           300.0  129.0       900.0
4      3.0           500.0  235.0      1500.0

In [9]:
import sqlite3

conn = sqlite3.connect('retail_sales.db')
cursor = conn.cursor()

cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()

print("Tables in the database:")
for table in tables:
    print(table[0])

conn.close()

Tables in the database:

In [10]:
import os
print(os.listdir('.'))

['.git', '.ipynb_checkpoints', 'README.md', 'retail.db', 'retail_sales.db', 'SQL - Retail Sales Analysis_utf .csv', 'sql_query_p1.sql', 'Untitled.ipynb']

In [11]:
import sqlite3

def list_tables(db_file):
    conn = sqlite3.connect(db_file)
    cursor = conn.cursor()
    cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
    tables = cursor.fetchall()
    conn.close()
    print(f"Tables in {db_file}:")
    if tables:
        for table in tables:
            print(table[0])
    else:
        print("No tables found.")

# Check both files
list_tables('retail.db')
list_tables('retail_sales.db')

Tables in retail.db:
retail_sales
Tables in retail_sales.db:
No tables found.

In [12]:


# Connect to your database file
conn = sqlite3.connect('retail.db')

# Load a sample of your data
df = pd.read_sql_query("SELECT * FROM retail_sales LIMIT 10;", conn)
print(df.head())

conn.close()

  transactions_id   sale_date sale_time customer_id  gender age  category  \
0             180  2022-11-05  10:47:00         117    Male  41  Clothing
1             522  2022-07-09  11:00:00          52    Male  46    Beauty
2             559  2022-12-12  10:48:00           5  Female  40  Clothing
3            1180  2022-01-06  08:53:00          85    Male  41  Clothing
4            1522  2022-11-14  08:35:00          48    Male  46    Beauty

  quantiy price_per_unit cogs total_sale
0       3            300  129        900
1       3            500  145       1500
2       4            300   84       1200
3       3            300  129        900
4       3            500  235       1500

In [27]:
# Fix typo in 'quantiy' column and convert necessary columns to numeric
df = df.rename(columns={
    'quantiy': 'quantity',
    'price_per_unit': 'price_per_unit',
    'cogs': 'cogs',
    'total_sale': 'total_sale'
})

# Convert numeric columns from object to int
cols_to_convert = ['quantity', 'price_per_unit', 'cogs', 'total_sale', 'age']
df[cols_to_convert] = df[cols_to_convert].apply(pd.to_numeric)

In [28]:
df.head()

,transactions_id,sale_date,sale_time,customer_id,gender,age,category,quantity,price_per_unit,cogs,total_sale,profit,loss
0,180,2022-11-05,10:47:00,117,Male,41,Clothing,3,300,129.0,900,771.0,0
1,522,2022-07-09,11:00:00,52,Male,46,Beauty,3,500,145.0,1500,1355.0,0
2,559,2022-12-12,10:48:00,5,Female,40,Clothing,4,300,84.0,1200,1116.0,0
3,1180,2022-01-06,08:53:00,85,Male,41,Clothing,3,300,129.0,900,771.0,0
4,1522,2022-11-14,08:35:00,48,Male,46,Beauty,3,500,235.0,1500,1265.0,0

In [29]:
category_sales = df.groupby('category')['total_sale'].sum().sort_values(ascending=False)
print(category_sales)

category
Clothing       5850
Beauty         3025
Electronics      90
Name: total_sale, dtype: int64

In [30]:
# Create a profit column
df['profit'] = df['total_sale'] - df['cogs']

# Create a loss column (only shows loss amount, otherwise 0)
df['loss'] = df['profit'].apply(lambda x: -x if x < 0 else 0)

# Group by category and summarize
grouped_df = df.groupby('category').agg({
    'quantity': 'sum',
    'price_per_unit': 'mean',
    'total_sale': 'sum',
    'cogs': 'sum',
    'profit': 'sum',
    'loss': 'sum'  # sum of losses (converted to positive)
}).reset_index()

# Rename columns
grouped_df.columns = [
    'Category', 'Total Quantity', 'Avg Price/Unit',
    'Total Sales', 'Total COGS', 'Total Profit', 'Total Loss'
]

# Display result
print(grouped_df)

      Category  Total Quantity  Avg Price/Unit  Total Sales  Total COGS  \
0       Beauty               7      341.666667         3025       390.5
1     Clothing              20      291.666667         5850       744.0
2  Electronics               3       30.000000           90        14.7

   Total Profit  Total Loss
0        2634.5           0
1        5106.0           0
2          75.3           0

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   transactions_id  10 non-null     object
 1   sale_date        10 non-null     object
 2   sale_time        10 non-null     object
 3   customer_id      10 non-null     object
 4   gender           10 non-null     object
 5   age              10 non-null     int64
 6   category         10 non-null     object
 7   quantity         10 non-null     int64
 8   price_per_unit   10 non-null     int64
 9   cogs             10 non-null     float64
 10  total_sale       10 non-null     int64
 11  profit           10 non-null     float64
 12  loss             10 non-null     int64
dtypes: float64(2), int64(5), object(6)
memory usage: 1.1+ KB

In [32]:
df['category'].unique()

array(['Clothing', 'Beauty', 'Electronics'], dtype=object)

In [36]:
clothing_df = df[df['category'] == 'Clothing']
clothing_df

,transactions_id,sale_date,sale_time,customer_id,gender,age,category,quantity,price_per_unit,cogs,total_sale,profit,loss
0,180,2022-11-05,10:47:00,117,Male,41,Clothing,3,300,129.0,900,771.0,0
2,559,2022-12-12,10:48:00,5,Female,40,Clothing,4,300,84.0,1200,1116.0,0
3,1180,2022-01-06,08:53:00,85,Male,41,Clothing,3,300,129.0,900,771.0,0
5,1559,2022-08-20,07:40:00,49,Female,40,Clothing,4,300,144.0,1200,1056.0,0
6,163,2022-10-31,09:38:00,144,Female,64,Clothing,3,50,23.0,150,127.0,0
8,421,2022-04-08,08:43:00,66,Female,37,Clothing,3,500,235.0,1500,1265.0,0

In [39]:
beauty_df=df[df['category']=='Beauty']
beauty_df

,transactions_id,sale_date,sale_time,customer_id,gender,age,category,quantity,price_per_unit,cogs,total_sale,profit,loss
1,522,2022-07-09,11:00:00,52,Male,46,Beauty,3,500,145.0,1500,1355.0,0
4,1522,2022-11-14,08:35:00,48,Male,46,Beauty,3,500,235.0,1500,1265.0,0
9,979,2022-05-18,10:18:00,6,Female,19,Beauty,1,25,10.5,25,14.5,0

In [40]:
beauty_df=df[df['category']=='Electronics']
beauty_df

,transactions_id,sale_date,sale_time,customer_id,gender,age,category,quantity,price_per_unit,cogs,total_sale,profit,loss
7,303,2022-04-22,11:09:00,54,Male,19,Electronics,3,30,14.7,90,75.3,0

In [45]:
import statsmodels.api as sm

X = df['quantity']
y = df['total_sale']

# Add constant for intercept
X = sm.add_constant(X)

model = sm.OLS(y, X).fit()
print(model.summary())

                            OLS Regression Results
==============================================================================
Dep. Variable:             total_sale   R-squared:                       0.284
Model:                            OLS   Adj. R-squared:                  0.194
Method:                 Least Squares   F-statistic:                     3.169
Date:                Fri, 30 May 2025   Prob (F-statistic):              0.113
Time:                        13:33:47   Log-Likelihood:                -75.970
No. Observations:                  10   AIC:                             155.9
Df Residuals:                       8   BIC:                             156.5
Df Model:                           1
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
const       -278.5000    681.716     -0.409      0.694   -1850.541    1293.541
quantity     391.6667    220.023      1.780      0.113    -115.707     899.041
==============================================================================
Omnibus:                        0.335   Durbin-Watson:                   1.975
Prob(Omnibus):                  0.846   Jarque-Bera (JB):                0.447
Skew:                          -0.253   Prob(JB):                        0.800
Kurtosis:                       2.096   Cond. No.                         13.6
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.

C:\Users\This PC\anaconda3\envs\learn-env\lib\site-packages\scipy\stats\stats.py:1603: UserWarning: kurtosistest only valid for n>=20 ... continuing anyway, n=10
  warnings.warn("kurtosistest only valid for n>=20 ... continuing "

In [46]:
from scipy.stats import ttest_ind

male_sales = df[df['gender'] == 'Male']['total_sale']
female_sales = df[df['gender'] == 'Female']['total_sale']

t_stat, p_val = ttest_ind(male_sales, female_sales)
print(f"T-statistic: {t_stat}, P-value: {p_val}")

T-statistic: 0.40892863415161823, P-value: 0.6933203606237719